[
  {
    "tournamentId": "abc123",
    "tournamentName": "Kejuaraan Karate Indonesia",
    "desc": "Kejuaraan karate tingkat nasional yang diadakan setiap tahun oleh Persatuan Karate Indonesia. Turnamen ini merupakan ajang prestisius bagi para atlet karate dari seluruh Indonesia untuk memperlihatkan kemampuan mereka. Dalam kejuaraan ini, para atlet akan berkompetisi dalam berbagai kategori dan tingkatan, mulai dari pemula hingga tingkat profesional. Selain itu, turnamen ini juga menjadi ajang seleksi untuk membentuk tim nasional karate yang akan mewakili Indonesia dalam kompetisi internasional.",
    "status": "pendaftaran",
    "hostedBy": "Persatuan Karate Indonesia",
    "divisionIds": []
  },
  {
    "tournamentId": "def456",
    "tournamentName": "Kejuaraan Karate Tokyo",
    "desc": "Kejuaraan karate yang diselenggarakan di Tokyo, Jepang oleh Federasi Karate Jepang. Turnamen ini menjadi salah satu event karate terbesar di Jepang, menarik partisipasi dari atlet-atlet karate terbaik di seluruh negeri. Dalam kompetisi ini, para atlet akan berhadapan dalam pertarungan sengit untuk meraih gelar juara di berbagai kategori dan tingkatan. Kejuaraan Karate Tokyo juga menjadi ajang untuk mempromosikan budaya karate Jepang kepada dunia.",
    "status": "akan main",
    "hostedBy": "Federasi Karate Jepang",
    "divisionIds": []
  },
  {
    "tournamentId": "ghi789",
    "tournamentName": "Piala Karate Jakarta",
    "desc": "Turnamen karate bergengsi di Jakarta yang diorganisir oleh Persatuan Olahraga Karate DKI Jakarta. Piala Karate Jakarta menjadi ajang yang dinantikan oleh para karateka di wilayah Jakarta dan sekitarnya. Kompetisi ini menampilkan pertandingan karate yang menarik dan penuh aksi dari atlet-atlet terbaik di ibu kota. Dalam turnamen ini, peserta akan berkompetisi dalam berbagai kategori dan tingkatan, memberikan penonton pengalaman yang tak terlupakan.",
    "status": "berlangsung",
    "hostedBy": "Persatuan Olahraga Karate DKI Jakarta",
    "divisionIds": []
  },
  {
    "tournamentId": "jkl012",
    "tournamentName": "Kejuaraan Karate Bali",
    "desc": "Kejuaraan karate yang diadakan di Bali oleh Asosiasi Karate Bali. Turnamen ini merupakan salah satu event olahraga terbesar di pulau Dewata, mengundang partisipasi dari atlet-atlet karate dari seluruh Indonesia. Kejuaraan Karate Bali tidak hanya menjadi ajang kompetisi yang seru, tetapi juga menjadi kesempatan bagi atlet untuk merasakan keindahan alam dan budaya Bali. Dalam turnamen ini, para peserta akan bertarung dengan semangat juang dan mengukir prestasi yang membanggakan.",
    "status": "selesai",
    "hostedBy": "Asosiasi Karate Bali",
    "divisionIds": []
  }
]
